OFtutorialTest04_MRF/rhoSimpleFoam/turbine_noMRF/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tinlet          298;

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;

boundaryField
{
    
    INFLOW
    {
        // type            fixedValue;
        // value           uniform (-10 0 0);
		type            fixedValue;
		value           $internalField;
    }
    OUTFLOW
    {
        // type            inletOutlet;
        // inletValue      uniform (0 0 0);
        // value           uniform (0 0 0);
		// type            zeroGradient;

        type            inletOutlet;
        inletValue      uniform $Tinlet;
        value           $inletValue;		
    }
    
    BLADE
    {
        type            zeroGradient;
    }

    HUB
    {
        type            zeroGradient;
    }
    
    SHROUD
    {
        type            zeroGradient;
    }
    
    PER1
    {
        type            cyclicAMI;
    }
    
    PER2
    {
        type            cyclicAMI;
    }
    
}


// ************************************************************************* //
