OFtutorialTest04_MRF/rhoSimpleFoam/turbine_noMRF/0/Urel
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      Urel;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
50904
(
(-50.001204 0.004673386 0)
(-50.001178 0.004586549 0)
(-50.001104 0.0046607282 0)
(-50.001082 0.0045819812 0)
(-50.001207 0.0046734154 0)
(-50.00118 0.0045864245 0)
(-50.001106 0.0046607942 0)
(-50.001085 0.0045819096 0)
...
)
;

boundaryField
{
    HUB
    {
        type            noSlip;
    }
    SHROUD
    {
        type            noSlip;
    }
    INFLOW
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    OUTFLOW
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    BLADE
    {
        type            noSlip;
    }
    PER1
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
    PER2
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
