OFtutorialTest04_MRF/rhoSimpleFoam/turbine_noMRF/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    
    INFLOW
    {
        type            calculated;
        value           uniform 0;
    }
    OUTFLOW
    {
        type            calculated;
        value           uniform 0;
		
    }
    
    BLADE
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

    HUB
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    
    SHROUD
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    
    PER1
    {
        type            cyclicAMI;
    }
    
    PER2
    {
        type            cyclicAMI;
    }
}


// ************************************************************************* //
