OFtutorialTest04_MRF/rhoSimpleFoam/turbine_noMRF/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

flowVelocity         (-50 0 0);
pressure             1e5;
turbulentKE          0.01;
turbulentOmega       10;

// ************************************************************************* //
