OFtutorialTest04_MRF/rhoSimpleFoam/turbine_noMRF/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoSimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          2;

writeControl    timeStep;

writeInterval   50;

purgeWrite      5;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// functions
// {
    // #includeFunc MachNo
    // #includeFunc solverInfo

    // readFields1
    // {
        // type        readFields;
        // libs        (fieldFunctionObjects);
        // fields      (phi);
        // readOnStart true;
    // }

    // contErr
    // {
        // type            div;
        // libs            (fieldFunctionObjects);
        // field           phi;
        // executeControl  writeTime;
        // writeControl    writeTime;
    // }

    // momErr
    // {
        // type            momentumError;
        // libs            (fieldFunctionObjects);
        // cellZones       (z1);
        // nLayers         2;
        // executeControl  writeTime;
        // writeControl    writeTime;
    // }
// }


// ************************************************************************* //
